C语言学习打卡----------------day1  2020-1-10

1.头文件
函数使用前必先定义     
包含文件等同于拷贝定义      
“”包含先从当前目录 没有再去默认（编辑器）   <>从默认库文件

2.C编译过   
源程序-------预处理（还是源程序.c）---编译（变成汇编-.s）----汇编（二进制文件.o）------链接

3.输入输出
*1. 当使用%s读取字符串串时，遇到空白字符（空格、制表符，回车符）就结束
*2. 使用%c读取字符时，任何字符都能读取，但只读一个
*3. 使用%d,%f,%lf 读取nt , float,  double类型数据时，会自动转换成对应数据，但是如果遇到其他字符（比如a）,就会读取失败

4.字符串
以字符数组形式存储        最后会加一个0（\0）方便存储 
scanf  以空白字符为分隔符 读不到  gets 读取一行 不读回车符  fgets(name，long，stdin)  实际读少一个（\0）


5.数组  
定义: 类型 []

6.字符串和数组
char  name[10] = "Rock"; //相当于char name[10] = {'R', 'o', 'c', 'k', '\0'};   字符串和字符数组是两个东西

7.函数
sizeof（）返回数组占几个字节（适配字符）
*** 
char *  fgets( char *str,  int num,  FILE *stream );
参数:
    num： 最多读取num-1个字符，或者遇到文件结束符EOF为止（即“文件读完了”）
返回值; 读取失败时， 返回NULL,
        读取成功时，返回str
***
 #include <stdio.h>
 int fputs( const char *str, FILE *stream );
 int fputc( int ch, FILE *stream );
 int fscanf( FILE *stream, const char *format, ... );成功时，返回实际读取的数据个数失败时，返回 EOF （-1）匹配失败时，返回0



8.文件操作












